#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура ICOM_Формы_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"ICOM_Формы_Примечание",
			ОбщегоНазначения.ОписаниеТипаСтрока(1000),
			,
			"Примечание"
		)
	);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	Группа = Элементы.Вставить(
		"ICOM_Формы_Дополнительно",
		Тип("ГруппаФормы"),
		ЭтотОбъект,
		Элементы.Комментарий
	);
	Группа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.Заголовок           = "Дополнительно";
	Группа.ОтображатьЗаголовок = Истина;

	Поле = Элементы.Добавить(
		"ICOM_Формы_Примечание",
		Тип("ПолеФормы"),
		Элементы.ICOM_Формы_Дополнительно
	);
	Поле.Вид                = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным        = "ICOM_Формы_Примечание";
	Поле.МногострочныйРежим = Истина;

	Поле = Элементы.Добавить(
		"ICOM_Формы_КомментарийДляСклада",
		Тип("ПолеФормы"),
		Элементы.ГруппаШапка
	);
	Поле.Вид         = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "Объект.ICOM_КомментарийДляСклада";

	ЭтотОбъект["ICOM_Формы_Примечание"] = Объект.Комментарий;

КонецПроцедуры

&НаСервере
&Перед("ПередЗаписьюНаСервере")
Процедура ICOM_Формы_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.Комментарий = ЭтотОбъект["ICOM_Формы_Примечание"];

КонецПроцедуры

#КонецОбласти
