#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.Заказ") Тогда
		Возврат;
	КонецЕсли;

	ЗначенияОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДанныеЗаполнения,
		"Контрагент"
	);

	Контрагент = ЗначенияОснования.Контрагент;

	Основание = ДанныеЗаполнения;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Строки.Номенклатура КАК Номенклатура,
		|	Строки.Количество КАК Количество
		|ИЗ
		|	Документ.Заказ.Товары КАК Строки
		|ГДЕ
		|	Строки.Ссылка = &Основание
		|УПОРЯДОЧИТЬ ПО
		|	Строки.НомерСтроки";
	Запрос.УстановитьПараметр(
		"Основание",
		ДанныеЗаполнения
	);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Товары.Очистить();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
