#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура ICOM_Формы_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Надпись = Элементы.Вставить(
		"ICOM_Формы_СуммаПродаж",
		Тип("ДекорацияФормы"),
		ЭтотОбъект,
		Элементы.Договор
	);
	Надпись.Вид = ВидДекорацииФормы.Надпись;

	Команда = Команды.Добавить("ICOM_Формы_ПересчитатьСуммы");
	Команда.Заголовок = "Пересчитать суммы";
	Команда.Действие  = "ICOM_Формы_ПересчитатьСуммы";

	Кнопка = Элементы.Добавить(
		"ICOM_Формы_ПересчитатьСуммы",
		Тип("КнопкаФормы"),
		КоманднаяПанель
	);
	Кнопка.ИмяКоманды = "ICOM_Формы_ПересчитатьСуммы";

	Элементы.Контрагент.УстановитьДействие(
		"ПриИзменении",
		"ICOM_Формы_КонтрагентПриИзменении"
	);

	ICOM_Формы_ОбновитьСуммаПродаж();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ICOM_Формы_КонтрагентПриИзменении(Элемент)

	ICOM_Формы_КонтрагентПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ICOM_Формы_ПересчитатьСуммы(Команда)

	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Цена;
	КонецЦикла;

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ICOM_Формы_ОбновитьСуммаПродаж()

	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Элементы.ICOM_Формы_СуммаПродаж.Заголовок = "";
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(Реализации.СуммаДокумента) КАК Значение
		|ИЗ
		|	Документ.Реализация КАК Реализации
		|ГДЕ
		|	Реализации.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр(
		"Контрагент",
		Объект.Контрагент
	);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Значение = 0;
	Если Выборка.Следующий() И Выборка.Значение <> NULL Тогда
		Значение = Выборка.Значение;
	КонецЕсли;

	Элементы.ICOM_Формы_СуммаПродаж.Заголовок = СтрШаблон(
		"Продажи: %1",
		Формат(Значение, "ЧДЦ=2; ЧН=0")
	);

КонецПроцедуры

&НаСервере
Процедура ICOM_Формы_КонтрагентПриИзмененииНаСервере()

	ICOM_Формы_ОбновитьСуммаПродаж();
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ВладелецДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.Договор,
			"Владелец"
		);
		Если ВладелецДоговор <> Объект.Контрагент Тогда
			Объект.Договор = Справочники.Договоры.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
