#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сведения о внешней обработке для подсистемы ДополнительныеОтчетыИОбработки.
//
// Возвращаемое значение:
//  Структура - см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке.
//
Функция СведенияОВнешнейОбработке() Экспорт

	МетаданныеОбработки = Метаданные();

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид    = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия = "1.0";

	ПараметрыРегистрации.Назначение.Добавить("Документ.Реализация");

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление        = "Акт";
	НоваяКоманда.Идентификатор        = МетаданныеОбработки.Имя;
	НоваяКоманда.Использование        = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	НоваяКоманда.Модификатор          = "ПечатьMXL";

	Возврат ПараметрыРегистрации;

КонецФункции

// Формирует печатные формы. Вызывается подсистемой Печать (УправлениеПечатью.ПечатьПоВнешнемуИсточнику).
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на печатаемые объекты.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные формы.
//  ОбъектыПечати - СписокЗначений - области объектов в табличном документе.
//  ПараметрыВывода - Структура - параметры вывода.
//
Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ИдентификаторКоманды = Метаданные().Имя;
	НужноПечатать = УправлениеПечатью.НужноПечататьМакет(
		КоллекцияПечатныхФорм,
		ИдентификаторКоманды
	);
	Если НужноПечатать Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИдентификаторКоманды,
			"Акт",
			СформироватьАкт(
				МассивОбъектов,
				ОбъектыПечати
			)
		);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьАкт(МассивОбъектов, ОбъектыПечати)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеОбъекта.Ссылка КАК Ссылка,
		|	ДанныеОбъекта.Номер КАК Номер,
		|	ДанныеОбъекта.Дата КАК Дата,
		|	ДанныеОбъекта.Контрагент КАК Контрагент,
		|	ДанныеОбъекта.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество
		|	) КАК СтрокиТаблицы
		|ИЗ
		|	Документ.Реализация КАК ДанныеОбъекта
		|ГДЕ
		|	ДанныеОбъекта.Ссылка В (&МассивОбъектов)";
	Запрос.УстановитьПараметр(
		"МассивОбъектов",
		МассивОбъектов
	);

	РезультатЗапроса = Запрос.Выполнить();
	Шапка = РезультатЗапроса.Выбрать();

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ICOM_Акт";

	Макет = ПолучитьМакет("ПФ_MXL_ICOM_Акт");

	Пока Шапка.Следующий() Цикл

		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ТекстЗаголовка = СтрШаблон(
			"Акт № %1 от %2",
			Шапка.Номер,
			Формат(Шапка.Дата, "ДЛФ=D")
		);

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		Итоги = Новый Структура;
		Итоги.Вставить("ИтогоКоличество", 0);

		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Строки = Шапка.СтрокиТаблицы.Выбрать();
		Пока Строки.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(Строки);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Итоги.ИтогоКоличество = Итоги.ИтогоКоличество + Строки.Количество;
		КонецЦикла;

		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ЗаполнитьЗначенияСвойств(
			ОбластьМакета.Параметры,
			Итоги
		);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			Шапка.Ссылка
		);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение "Недопустимый вызов объекта на клиенте.";
#КонецЕсли
