#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Настройки объекта для подсистемы Печать.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт

	Настройки.ПриДобавленииКомандПечати = Истина;

КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор                  = "ICOM_Акт";
	КомандаПечати.Представление                  = "Акт";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок                        = 90;

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на печатаемые объекты.
//  ПараметрыПечати - Структура - параметры печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные формы.
//  ОбъектыПечати - СписокЗначений - области объектов в табличном документе.
//  ПараметрыВывода - Структура - параметры вывода.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	НужноПечатать = УправлениеПечатью.НужноПечататьМакет(
		КоллекцияПечатныхФорм,
		"ICOM_Акт"
	);
	Если НужноПечатать Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ICOM_Акт",
			"Акт",
			ICOM_Печать_СформироватьАкт(
				МассивОбъектов,
				ОбъектыПечати
			),
			,
			"Документ.Реализация.ПФ_MXL_ICOM_Акт"
		);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ICOM_Печать_СформироватьАкт(МассивОбъектов, ОбъектыПечати)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеОбъекта.Ссылка КАК Ссылка,
		|	ДанныеОбъекта.Номер КАК Номер,
		|	ДанныеОбъекта.Дата КАК Дата,
		|	ДанныеОбъекта.Контрагент КАК Контрагент,
		|	ДанныеОбъекта.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Количество * Цена КАК Сумма
		|	) КАК СтрокиТаблицы
		|ИЗ
		|	Документ.Реализация КАК ДанныеОбъекта
		|ГДЕ
		|	ДанныеОбъекта.Ссылка В (&МассивОбъектов)";
	Запрос.УстановитьПараметр(
		"МассивОбъектов",
		МассивОбъектов
	);

	РезультатЗапроса = Запрос.Выполнить();
	Шапка = РезультатЗапроса.Выбрать();

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ICOM_Акт";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_MXL_ICOM_Акт");

	Пока Шапка.Следующий() Цикл

		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ТекстЗаголовка = СтрШаблон(
			"Акт № %1 от %2",
			Шапка.Номер,
			Формат(Шапка.Дата, "ДЛФ=D")
		);

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		Итоги = Новый Структура;
		Итоги.Вставить("ИтогоКоличество", 0);
		Итоги.Вставить("ИтогоСумма", 0);

		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Строки = Шапка.СтрокиТаблицы.Выбрать();
		Пока Строки.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(Строки);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Итоги.ИтогоКоличество = Итоги.ИтогоКоличество + Строки.Количество;
			Итоги.ИтогоСумма = Итоги.ИтогоСумма + Строки.Сумма;
		КонецЦикла;

		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ЗаполнитьЗначенияСвойств(
			ОбластьМакета.Параметры,
			Итоги
		);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьМакета.Параметры.СуммаПрописью = ЧислоПрописью(
			Итоги.ИтогоСумма,
			"Л=ru_RU; ДП=Истина",
			"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"
		);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			Шапка.Ссылка
		);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#КонецЕсли
