#Область ПрограммныйИнтерфейс

&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура ICOM_Команды_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд)

	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя                    = "ICOM_Команды_Действия";
	Вид.Заголовок              = "Действия";
	Вид.Отображение            = ОтображениеКнопки.КартинкаИТекст;
	Вид.ВажностьПриОтображении = ВажностьПриОтображении.Обычная;

КонецПроцедуры

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура ICOM_Команды_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)

	Если Источники.Строки.Найти(Метаданные.Документы.Заказ, "Метаданные") <> Неопределено Тогда
		Команда = Команды.Добавить();
		Команда.Вид                = "ICOM_Команды_Действия";
		Команда.Представление      = "Сумма выбранных";
		Команда.ТипПараметра       = Новый ОписаниеТипов("ДокументСсылка.Заказ");
		Команда.РежимЗаписи        = "НеЗаписывать";
		Команда.ВидимостьВФормах   = "ФормаСписка";
		Команда.МножественныйВыбор = Истина;
		Команда.Обработчик         = "ICOM_Команды_ПодключаемыеКоманды.СуммаВыбранных";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
