#Область ПрограммныйИнтерфейс

// Обработчик подключаемой команды "Сумма выбранных".
//
// Параметры:
//  ПараметрКоманды - Массив, ЛюбаяСсылка - выбранные объекты.
//  ПараметрыВыполнения - см. ПодключаемыеКоманды.ПараметрыВыполненияКоманды.
//
Процедура СуммаВыбранных(ПараметрКоманды, ПараметрыВыполнения) Экспорт

	Ссылки = Новый Массив;
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Ссылки = ПараметрКоманды;
	Иначе
		Ссылки.Добавить(ПараметрКоманды);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(Заказы.СуммаДокумента) КАК Значение
		|ИЗ
		|	Документ.Заказ КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка В (&Ссылки)";
	Запрос.УстановитьПараметр(
		"Ссылки",
		Ссылки
	);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Значение = 0;
	Если Выборка.Следующий() И Выборка.Значение <> NULL Тогда
		Значение = Выборка.Значение;
	КонецЕсли;

	ПараметрыВыполнения.Результат.Текст = СтрШаблон(
		"Сумма: %1",
		Формат(Значение, "ЧДЦ=2; ЧН=0")
	);

КонецПроцедуры

#КонецОбласти
